// 1.Число (number) - 1, 1.5, NaN, Infinity
//  Включає цілі та числа з плаваючою точкою.
//  Спеціальні значення: Infinity, -Infinity, та NaN.
//  Максимальне і мінімальне значення обмежені до ±(2^53 - 1).

// 2.Велике ціле число (BigInt): 1n, 1234567890123456789012345678901234567890n
//  Використовується для представлення великих цілих чисел.
//  Оголошується додаванням n в кінці числа.

// 3.Оголошується використовуючи лапки: подвійні (""), одинарні (''), або зворотні (``)
//  Зворотні лапки дозволяють вбудовувати вирази за допомогою ${}.

// 4.Булевий (логічний) тип: true, false
//  Приймає значення true або false.

// 5.null: null
//  Вказує на відсутність значення або невизначеність.
//  При виклику typeof повертає "object", що є особливістю JavaScript.

// 6.undefined: undefined
//  Вказує на те, що значення не було присвоєно.

// 7.Об'єкт: { name: 'John', age: 30 }
//  Колекція ключ-значення, створена за допомогою фігурних дужок {} або через конструктор new Object().

// 8.Cимвол: Symbol('id')
//  Унікальні ідентифікатори, створені за допомогою конструктора Symbol().

// Оператор typeof повертає тип аргументу.
