// 8. Контекст выполнения (Execution Context)
// this по дефолту вказує на window: У глобальному контексті, коли функція викликається без прив'язки контексту, this посилається на глобальний об'єкт (window в браузері).
// this вказує на об'єкт, на який ми зсилаємося: Якщо функція викликається як метод об'єкта (вкладена в об'єкт), то this посилається на сам об'єкт, до якого вона прикріплена.
// Коли функція викликається як метод об'єкта, this посилається на сам об'єкт: Це додається до попереднього пункту. Коли функція є методом об'єкта, this вказує на об'єкт, до якого вона належить.
// Коли функція викликається як конструктор (з оператором new), this посилається на новий створений об'єкт: При виклику функції як конструктора (за допомогою new), this вказує на новий об'єкт, який створюється конструктором.

const obj = { value: 42 };

function getValue() {
  console.log(this.value);
}

// Виклик функції з call

getValue.call(obj);

// Виклик функції з apply

getValue2.apply(obj2);

// Виклик функції з bind

const boundGetValue3 = getValue3.bind(obj3);
boundGetValue3();
